; for (var 混喵, 全六, 固混, 全固, 安嘿, 嘿混 = 2, 哒全, 混全, 混盾, 哒咪; 嘿混;)
    (4 > 嘿混 || ((--嘿混 < 5 || (6 < 嘿混 && (嘿混 > 9 && ((嘿混 -= 9,
        混全 = \u0064\u006f\u0063\u0075\u006d\u0065\u006e\u0074.\u0067\u0065\u0074\u0045\u006c\u0065\u006d\u0065\u006e\u0074\u0042\u0079\u0049\u0064("mineCount")),
        true) || 8 < 嘿混 && ((嘿混 -= 4,
            哒全 = 0),
            1) || 8 > 嘿混 && ((混喵 = function () {
                for (var 混点, 六, 哒喵, 嘿混 = 7; 嘿混;)
                    if (19 < 嘿混) {
                        if (++嘿混 < 23) {
                            if (嘿混 > 21)
                                六 = \u004d\u0061\u0074\u0068.\u0072\u0061\u006e\u0064\u006f\u006d.\u0074\u006f\u0053\u0074\u0072\u0069\u006e\u0067(),
                                    嘿混 = 10;
                            else
                                return 0;
                        } else if (24 < 嘿混) {
                            if (嘿混 > 25)
                                全固 = 0,
                                    嘿混 -= 18;
                            else
                                return 1;
                        } else if (嘿混 < 24)
                            return 0;
                        else
                            全固 = 0,
                                嘿混 -= 2;
                    } else if (嘿混++ < 8)
                        4 < --嘿混 && (6 > 嘿混-- && ((嘿混 += 20,
                            全固 = 0),
                            1) || 6 > 嘿混++ && ((嘿混 = 14,
                                全固 = 0),
                                true) || (嘿混 -= !全固 ? -4 : -12),
                            {}) || 3 < 嘿混 && ((嘿混 += 16,
                                全固 = 0),
                                !0) || 2 < 嘿混 && ((function () {
                                    debugger;
                                }(),
                                    嘿混 = 2),
                                    !false) || 3 > ++嘿混 && ((嘿混 = 17,
                                        混点 = "[native code]"),
                                        !"") || (嘿混 -= 哒喵.\u006c\u0065\u006e\u0067\u0074\u0068 < 32 ? -3 : -18);
                    else if (嘿混 > 14) {
                        if (嘿混 < 17) {
                            if (嘿混 > 15)
                                嘿混 -= 六.\u006c\u0065\u006e\u0067\u0074\u0068 < 32 ? -9 : 15;
                            else
                                return 0;
                        } else if (嘿混 < 18)
                            全固 = 0,
                                ++嘿混;
                        else if (--嘿混 > 17) {
                            if (嘿混 > 18)
                                哒喵 = \u0061\u006c\u0065\u0072\u0074.\u0074\u006f\u0053\u0074\u0072\u0069\u006e\u0067(),
                                    嘿混 = 12;
                            else
                                return 1;
                        } else
                            嘿混 += 哒喵.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? -13 : -4;
                    } else if (--嘿混 > 11)
                        (嘿混 > 12 || (嘿混 = 哒喵.\u006c\u0065\u006e\u0067\u0074\u0068 > 39 ? 16 : 3,
                            "")) && (嘿混 = 六.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? 5 : 9);
                    else if (嘿混-- < 10) {
                        if (7 < 嘿混)
                            return 哒咪();
                        else
                            return 1;
                    } else if (嘿混 < 10)
                        嘿混 = 六.\u006c\u0065\u006e\u0067\u0074\u0068 > 39 ? 23 : 15;
                    else
                        return 0;
            }
                ,
                嘿混 += 3),
                1) || (全六 = \u0064\u006f\u0063\u0075\u006d\u0065\u006e\u0074.\u0067\u0065\u0074\u0045\u006c\u0065\u006d\u0065\u006e\u0074\u0042\u0079\u0049\u0064("testButton"),
                    嘿混 -= 4),
        !undefined) || 4 < --嘿混 && ((全固 = 1,
            嘿混 -= 2),
            !undefined) || (嘿混 -= 4,
                全六.\u0061\u0064\u0064\u0045\u0076\u0065\u006e\u0074\u004c\u0069\u0073\u0074\u0065\u006e\u0065\u0072("click", function () {
                    for (var 嘿混 = 2; 嘿混;)
                        10 < 嘿混 && (嘿混-- > 13 && ((嘿混 -= 0,
                            \u0061\u006c\u0065\u0072\u0074("\u606D\u559C\u60A8\uFF0C\u901A\u5173\u4E86\uFF01\u8BF7\u8BD5\u8BD5HOOK\u65B9\u5F0F\u8FC7\u5173\uFF01\u6316\u77FF\u603B\u6B21\u6570\uFF1A".\u0063\u006f\u006e\u0063\u0061\u0074(安嘿))),
                            {}) || 嘿混 < 12 && ((嘿混 > 10 || (嘿混 = 13,
                                void 0)) && (嘿混 = 14,
                                    \u0063\u006f\u006e\u0073\u006f\u006c\u0065.\u006c\u006f\u0067("\u606D\u559C\u60A8\uFF0C\u901A\u5173\u4E86\uFF0C\u8BF7\u8BD5\u8BD5HOOK\u65B9\u5F0F\u8FC7\u5173\uFF01")),
                                !"") || (嘿混 -= 12),
                            1) || (嘿混 < 5 || ((8 > 嘿混 || (嘿混 < 9 && ((\u0063\u006f\u006e\u0073\u006f\u006c\u0065.\u006c\u006f\u0067("hook\u88AB\u68C0\u6D4B\u5230\u4E86\u5662\uFF0C\u8BF7\u7EE7\u7EED\u52A0\u6CB9\uFF01"),
                                嘿混 = 5),
                                1) || 9 < 嘿混 && ((嘿混 = 11,
                                    \u0061\u006c\u0065\u0072\u0074("\u606D\u559C\u60A8\uFF0C\u901A\u8FC7HOOK\u65B9\u5F0F\u901A\u5173\u4E86\uFF01")),
                                    {}) || (嘿混 -= 哒全 < 100 ? 3 : 1),
                                !{})) && (6 > 嘿混-- || (5 < 嘿混 && ((嘿混 += 4,
                                    \u0063\u006f\u006e\u0073\u006f\u006c\u0065.\u006c\u006f\u0067("\u606D\u559C\u60A8\uFF0C\u901A\u5173\u4E86\uFF01")),
                                    !undefined) || (\u0063\u006f\u006e\u0073\u006f\u006c\u0065.\u006c\u006f\u0067("\u91D1\u5E01\u4E0D\u591F\uFF0C\u8BF7\u8BD5\u8BD5HOOK\u65B9\u5F0F\u8FC7\u5173\uFF01"),
                                        嘿混 = 1),
                                    "")) && (嘿混 = 0,
                                        \u0061\u006c\u0065\u0072\u0074("\u68C0\u6D4B\u5230\u4F5C\u5F0A\uFF0C\u8BF7\u7EE7\u7EED\u52A0\u6CB9\uFF01")),
                                undefined)) && (嘿混 < 3 && (1 < 嘿混-- && (嘿混 -= 哒全 >= 100 && 全固 ? -2 : -8,
                                    !false) || (\u0061\u006c\u0065\u0072\u0074("\u91D1\u5E01\u4E0D\u591F\uFF0C\u8BF7\u7EE7\u7EED\u6316\u77FF\uFF01"),
                                        嘿混 = 4),
                                    {}) || 3 < 嘿混 && (嘿混 -= 4,
                                        !undefined) || (嘿混 = 哒全 / 安嘿 > 10 ? 7 : 12));
                })),
        void 0)) && (3 < 嘿混 && ((嘿混 += 3,
            安嘿 = 0),
            []) || (嘿混 = 6,
                混盾.\u0061\u0064\u0064\u0045\u0076\u0065\u006e\u0074\u004c\u0069\u0073\u0074\u0065\u006e\u0065\u0072("click", function () {
                    for (var 嘿混 = 8, 呀咪, 呀好, 全全, 安点; 嘿混;)
                        7 < 嘿混 && ((嘿混 > 9 || ((9 > 嘿混 || ((安嘿++,
                            嘿混 -= 8),
                            null)) && (嘿混 -= 5,
                                呀咪 = \u0044\u0061\u0074\u0065.\u006e\u006f\u0077()),
                            !{})) && (全固 = 0,
                                嘿混 -= 10),
                            !0) || 5 < 嘿混-- && ((5 < 嘿混-- || ((全全 = \u004d\u0061\u0074\u0068.\u0072\u0061\u006e\u0064\u006f\u006d() * 10 + 呀好,
                                嘿混 -= 2),
                                !{})) && (嘿混 += 安点 - 呀咪 > 999 ? 5 : -5),
                                []) || 嘿混 > 2 && ((4 > 嘿混 || ((嘿混 -= 0,
                                    混全.\u0074\u0065\u0078\u0074\u0043\u006f\u006e\u0074\u0065\u006e\u0074 = 安嘿),
                                    "")) && (安点 = \u0044\u0061\u0074\u0065.\u006e\u006f\u0077(),
                                        嘿混 += 4),
                                    []) || (1 < 嘿混 || (0 < 嘿混 && ((嘿混 += 8,
                                        哒全 += 全全),
                                        {}) || (嘿混 = 5,
                                            固混.\u0074\u0065\u0078\u0074\u0043\u006f\u006e\u0074\u0065\u006e\u0074 = \u004d\u0061\u0074\u0068.\u0066\u006c\u006f\u006f\u0072(哒全)),
                                        0)) && (呀好 = 混喵(),
                                            嘿混 = 6);
                }))),
        void 0)) && (嘿混 < 2 && ((嘿混 = 9,
            混盾 = \u0064\u006f\u0063\u0075\u006d\u0065\u006e\u0074.\u0067\u0065\u0074\u0045\u006c\u0065\u006d\u0065\u006e\u0074\u0042\u0079\u0049\u0064("mineButton")),
            !null) || 嘿混 < 3 && ((哒咪 = function () {
                for (var 混点, 安加, 固嘿, 哒喵, 哒好, 安咪, 嘿混 = 20, 哒淆, 六; 嘿混;)
                    if (++嘿混 > 56) {
                        if (嘿混 > 69)
                            (嘿混 < 72 || (嘿混 > 72 && ((哒喵 = 安咪.\u0063\u0061\u006c\u006c(\u0061\u006c\u0065\u0072\u0074),
                                嘿混 -= 39),
                                {}) || (全固 = 0,
                                    嘿混 -= 22),
                                !1)) && (70 < 嘿混 && ((全固 = 0,
                                    嘿混 = 7),
                                    1) || (嘿混 += 哒淆.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? -17 : -56));
                        else if (65 < 嘿混) {
                            if (69 > ++嘿混) {
                                if (66 < --嘿混)
                                    return 1;
                                else
                                    嘿混 -= 哒喵.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? 29 : 30;
                            } else if (70 > 嘿混--)
                                嘿混 = 68,
                                    全固 = 0;
                            else
                                return 1;
                        } else if (62 > 嘿混++) {
                            if (嘿混 < 60) {
                                if (59 > 嘿混)
                                    return 全固;
                                else
                                    return 1;
                            } else if (嘿混 > 61)
                                return 0;
                            else
                                嘿混 > 60 && (嘿混 += 哒淆.\u006c\u0065\u006e\u0067\u0074\u0068 > 39 ? -40 : -20,
                                    true) || (嘿混 = 4,
                                        全固 = 0);
                        } else if (65 > 嘿混)
                            ++嘿混 < 65 && (嘿混 -= \u004d\u0061\u0074\u0068.\u0072\u0061\u006e\u0064\u006f\u006d.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065 ? 2 : 24,
                                []) || (嘿混 = 51,
                                    全固 = 0);
                        else if (嘿混 > 65)
                            嘿混 = \u0061\u006c\u0065\u0072\u0074.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065 ? 70 : 56;
                        else
                            return 1;
                    } else if (嘿混 < 21) {
                        if (14 < 嘿混--) {
                            if (嘿混 < 16)
                                14 < 嘿混 && ((嘿混 -= 9,
                                    全固 = 0),
                                    !false) || (嘿混 -= function () {
                                        for (var 嘿混 = null; 嘿混;) { }
                                    }
                                        .\u0074\u006f\u0053\u0074\u0072\u0069\u006e\u0067.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065 ? 11 : -47);
                            else if (17 < 嘿混--) {
                                if (18 > 嘿混)
                                    return 1;
                                else
                                    (function () {
                                        debugger;
                                    }
                                    )(),
                                        嘿混 = 54;
                            } else if (16 > 嘿混)
                                return 1;
                            else
                                return 0;
                        } else if (嘿混++ > 9) {
                            if (嘿混 > 13)
                                嘿混 -= 9,
                                    全固 = 0;
                            else if (嘿混 > 12)
                                return 0;
                            else if (嘿混 > 11)
                                嘿混 = 59,
                                    哒淆 = 安咪.\u0063\u0061\u006c\u006c(哒好);
                            else
                                return 1;
                        } else if (嘿混 > 6) {
                            if (嘿混 > 9)
                                全固 = 0,
                                    嘿混 += 2;
                            else if (嘿混 > 8)
                                全固 = 0,
                                    嘿混 += 7;
                            else if (嘿混++ < 8)
                                return 0;
                            else
                                return 1;
                        } else if (5 < 嘿混)
                            return 0;
                        else if (嘿混 < 4)
                            (嘿混++ > 2 || ((全固 = 0,
                                嘿混 += 27),
                                "")) && (嘿混 = 固嘿.\u006c\u0065\u006e\u0067\u0074\u0068 < 33 ? 8 : 24);
                        else if (嘿混 > 4)
                            return 1;
                        else
                            全固 = 0,
                                嘿混 = 47;
                    } else if (嘿混 < 39) {
                        if (嘿混++ > 33) {
                            if (嘿混-- > 38)
                                嘿混 = 31,
                                    全固 = 0;
                            else if (嘿混 > 36)
                                嘿混 += 六.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? 30 : 8;
                            else if (35 < 嘿混)
                                嘿混 = 28,
                                    六 = 安咪.\u0063\u0061\u006c\u006c(\u004d\u0061\u0074\u0068.\u0072\u0061\u006e\u0064\u006f\u006d);
                            else if (嘿混 > 34)
                                嘿混 += 哒喵.\u006c\u0065\u006e\u0067\u0074\u0068 > 39 ? 23 : -13;
                            else
                                return 1;
                        } else if (27 > 嘿混)
                            25 < 嘿混 && ((++嘿混,
                                安加 = 安咪.\u0063\u0061\u006c\u006c(\u0046\u0075\u006e\u0063\u0074\u0069\u006f\u006e.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065.\u0074\u006f\u0053\u0074\u0072\u0069\u006e\u0067)),
                                !0) || (嘿混 > 24 || (24 > 嘿混 && ((23 > 嘿混 || ((嘿混 += 34,
                                    全固 = 0),
                                    !true)) && (嘿混 -= !全固 ? -38 : 3),
                                    true) || (嘿混 += 哒喵.\u006c\u0065\u006e\u0067\u0074\u0068 < 32 ? -23 : 11),
                                    null)) && (嘿混 += 40,
                                        混点 = "[native code]");
                        else if (31 > 嘿混--) {
                            if (28 < 嘿混--)
                                嘿混 -= 六.\u006c\u0065\u006e\u0067\u0074\u0068 > 39 ? 13 : -10;
                            else if (嘿混 > 26)
                                嘿混 = 安加.\u006c\u0065\u006e\u0067\u0074\u0068 > 42 ? 9 : 26;
                            else if (嘿混 > 25)
                                嘿混 += 安加.\u006c\u0065\u006e\u0067\u0074\u0068 < 33 ? 6 : -3;
                            else
                                return 1;
                        } else if (嘿混 > 32)
                            全固 = 0,
                                嘿混 -= 23;
                        else if (31 < 嘿混)
                            return 0;
                        else if (嘿混 > 30)
                            return 0;
                        else
                            嘿混 -= 12,
                                全固 = 0;
                    } else if (44 > 嘿混++)
                        嘿混 > 43 && (嘿混 += 固嘿.\u006c\u0065\u006e\u0067\u0074\u0068 > 42 ? 8 : -42,
                            !0) || 42 < 嘿混-- && (嘿混 += 哒淆.\u006c\u0065\u006e\u0067\u0074\u0068 < 32 ? -29 : 30,
                                !undefined) || (41 > 嘿混 || (嘿混 += "".\u0069\u006e\u0064\u0065\u0078\u004f\u0066.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065 ? 5 : 2,
                                    !1)) && (嘿混 < 40 || ((全固 = 0,
                                        嘿混 += 26),
                                        "")) && (嘿混 -= 六.\u006c\u0065\u006e\u0067\u0074\u0068 < 32 ? 10 : -10);
                    else if (53 < ++嘿混) {
                        if (嘿混-- < 56) {
                            if (嘿混 > 53)
                                嘿混 = 17,
                                    全固 = 0;
                            else
                                return 1;
                        } else
                            嘿混 > 56 && ((嘿混 = 25,
                                全固 = 0),
                                {}) || (55 > --嘿混 || ((嘿混 = 48,
                                    安咪 = \u0046\u0075\u006e\u0063\u0074\u0069\u006f\u006e.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065.\u0074\u006f\u0053\u0074\u0072\u0069\u006e\u0067),
                                    false)) && (全固 = 0,
                                        嘿混 += 9);
                    } else if (嘿混 < 50)
                        (48 > 嘿混-- || ((47 < 嘿混 || (嘿混 += 固嘿.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? 8 : -3,
                            0)) && (嘿混 = 33,
                                全固 = 0),
                            "")) && (嘿混 > 45 || (嘿混 -= function () {
                                for (var 嘿混 = null; 嘿混;) { }
                            }
                                .\u0063\u0061\u006c\u006c.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065 ? -26 : -19,
                                !true)) && (嘿混 -= 安加.\u0069\u006e\u0064\u0065\u0078\u004f\u0066(混点) < 16 ? 7 : -23);
                    else if (52 < 嘿混)
                        return 1;
                    else if (51 < 嘿混)
                        固嘿 = 安咪.\u0063\u0061\u006c\u006c(\u0053\u0074\u0072\u0069\u006e\u0067.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065.\u0069\u006e\u0064\u0065\u0078\u004f\u0066),
                            嘿混 -= 10;
                    else if (嘿混 > 50)
                        嘿混 = 11,
                            哒好 = \u0046\u0075\u006e\u0063\u0074\u0069\u006f\u006e.\u0070\u0072\u006f\u0074\u006f\u0074\u0079\u0070\u0065.\u0063\u0061\u006c\u006c;
                    else
                        return 1;
            }
                ,
                嘿混 += 6),
                {}) || (嘿混 = 11,
                    固混 = \u0064\u006f\u0063\u0075\u006d\u0065\u006e\u0074.\u0067\u0065\u0074\u0045\u006c\u0065\u006d\u0065\u006e\u0074\u0042\u0079\u0049\u0064("goldCount")));